open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_wss.c
/****************************************************************************
 * app/bk7258/bk7258_voice_wss.c
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "bk7258_voice_wss.h"

#include <ctype.h>
#include <errno.h>
#include <stdio.h>
#include <string.h>
#include <strings.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BKVOICE_WSS_GUID \
  "258EAFA5-E914-47DA-95CA-C5AB0DC85B11"
#define BKVOICE_WSS_NONCE_BYTES       16u
#define BKVOICE_WSS_SHA1_BYTES        20u
#define BKVOICE_WSS_CLIENT_KEY_BYTES  25u
#define BKVOICE_WSS_ACCEPT_KEY_BYTES  29u
#define BKVOICE_WSS_REQUEST_BYTES     640u
#define BKVOICE_WSS_RESPONSE_BYTES    1024u
#define BKVOICE_WSS_CONTROL_BYTES     125u
#define BKVOICE_WSS_MASK_CHUNK_BYTES  128u

#define BKVOICE_WSS_OPCODE_CONTINUATION 0x0u
#define BKVOICE_WSS_OPCODE_TEXT         0x1u
#define BKVOICE_WSS_OPCODE_BINARY       0x2u
#define BKVOICE_WSS_OPCODE_CLOSE        0x8u
#define BKVOICE_WSS_OPCODE_PING         0x9u
#define BKVOICE_WSS_OPCODE_PONG         0xau

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const char g_bkvoice_wss_base64[] =
  "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static bool bkvoice_wss_tls_ops_valid(
  const struct bkvoice_wss_tls_ops_s *ops)
{
  return ops != NULL && ops->open_verified != NULL && ops->send != NULL &&
         ops->recv != NULL && ops->interrupt != NULL && ops->close != NULL &&
         ops->random != NULL && ops->sha1 != NULL;
}

static bool bkvoice_wss_host_valid(const char *host)
{
  size_t i;
  size_t length;

  if (host == NULL)
    {
      return false;
    }

  length = strlen(host);
  if (length == 0 || length > BKVOICE_WSS_HOST_MAX ||
      host[0] == '.' || host[length - 1] == '.')
    {
      return false;
    }

  for (i = 0; i < length; i++)
    {
      unsigned char ch = (unsigned char)host[i];

      if (!isalnum(ch) && ch != '.' && ch != '-')
        {
          return false;
        }
    }

  return true;
}

static bool bkvoice_wss_path_valid(const char *path)
{
  size_t i;
  size_t length;

  if (path == NULL)
    {
      return false;
    }

  length = strlen(path);
  if (length == 0 || length > BKVOICE_WSS_PATH_MAX || path[0] != '/')
    {
      return false;
    }

  for (i = 0; i < length; i++)
    {
      unsigned char ch = (unsigned char)path[i];

      if (ch <= 0x20u || ch >= 0x7fu || ch == '#')
        {
          return false;
        }
    }

  return true;
}

static bool bkvoice_wss_token_char(unsigned char ch)
{
  return isalnum(ch) || ch == '!' || ch == '#' || ch == '$' || ch == '%' ||
         ch == '&' || ch == 0x27u || ch == '*' || ch == '+' || ch == '-' ||
         ch == '.' || ch == '^' || ch == '_' || ch == '`' || ch == '|' ||
         ch == '~';
}

static bool bkvoice_wss_subprotocol_valid(const char *subprotocol)
{
  size_t i;
  size_t length;

  if (subprotocol == NULL)
    {
      return false;
    }

  length = strlen(subprotocol);
  if (length == 0 || length > BKVOICE_WSS_SUBPROTOCOL_MAX)
    {
      return false;
    }

  for (i = 0; i < length; i++)
    {
      if (!bkvoice_wss_token_char((unsigned char)subprotocol[i]))
        {
          return false;
        }
    }

  return true;
}

static int bkvoice_wss_base64_encode(const uint8_t *source,
                                     size_t source_size,
                                     char *output, size_t output_size)
{
  size_t needed = ((source_size + 2u) / 3u) * 4u;
  size_t input = 0;
  size_t written = 0;

  if (source == NULL || output == NULL || output_size <= needed)
    {
      return -EMSGSIZE;
    }

  while (input + 3u <= source_size)
    {
      uint32_t word = ((uint32_t)source[input] << 16) |
                      ((uint32_t)source[input + 1u] << 8) |
                      source[input + 2u];

      output[written++] = g_bkvoice_wss_base64[(word >> 18) & 0x3fu];
      output[written++] = g_bkvoice_wss_base64[(word >> 12) & 0x3fu];
      output[written++] = g_bkvoice_wss_base64[(word >> 6) & 0x3fu];
      output[written++] = g_bkvoice_wss_base64[word & 0x3fu];
      input += 3u;
    }

  if (input < source_size)
    {
      uint32_t word = (uint32_t)source[input] << 16;

      if (input + 1u < source_size)
        {
          word |= (uint32_t)source[input + 1u] << 8;
        }

      output[written++] = g_bkvoice_wss_base64[(word >> 18) & 0x3fu];
      output[written++] = g_bkvoice_wss_base64[(word >> 12) & 0x3fu];
      output[written++] = input + 1u < source_size ?
                          g_bkvoice_wss_base64[(word >> 6) & 0x3fu] : '=';
      output[written++] = '=';
    }

  output[written] = '\0';
  return (int)written;
}

static int bkvoice_wss_error(struct bkvoice_wss_s *wss, int error,
                             bool interrupt)
{
  if (error >= 0)
    {
      error = -EIO;
    }

  __atomic_store_n(&wss->last_error, error, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->faulted, true, __ATOMIC_RELEASE);
  if (interrupt && __atomic_load_n(&wss->tls_open, __ATOMIC_ACQUIRE))
    {
      (void)wss->tls_ops.interrupt(wss->tls_context);
    }

  return error;
}

static int bkvoice_wss_raw_send_all(struct bkvoice_wss_s *wss,
                                    const uint8_t *buffer, size_t bytes,
                                    uint64_t deadline_ms)
{
  size_t offset = 0;

  while (offset < bytes)
    {
      ssize_t sent = wss->tls_ops.send(wss->tls_context, buffer + offset,
                                       bytes - offset, deadline_ms);

      if (sent < 0)
        {
          return (int)sent;
        }

