open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_wss.c
      if (sent == 0)
        {
          return -EPIPE;
        }

      if ((size_t)sent > bytes - offset)
        {
          return -EPROTO;
        }

      offset += (size_t)sent;
    }

  return 0;
}

static int bkvoice_wss_raw_recv_exact(struct bkvoice_wss_s *wss,
                                      uint8_t *buffer, size_t bytes,
                                      uint64_t deadline_ms)
{
  size_t offset = 0;

  while (offset < bytes)
    {
      ssize_t received = wss->tls_ops.recv(wss->tls_context,
                                           buffer + offset, bytes - offset,
                                           deadline_ms);

      if (received < 0)
        {
          return (int)received;
        }

      if (received == 0)
        {
          return -ECONNRESET;
        }

      if ((size_t)received > bytes - offset)
        {
          return -EPROTO;
        }

      offset += (size_t)received;
    }

  return 0;
}

static int bkvoice_wss_make_accept(struct bkvoice_wss_s *wss,
                                   const char *client_key,
                                   char accept[BKVOICE_WSS_ACCEPT_KEY_BYTES])
{
  uint8_t digest[BKVOICE_WSS_SHA1_BYTES];
  char source[BKVOICE_WSS_CLIENT_KEY_BYTES + sizeof(BKVOICE_WSS_GUID)];
  int ret;

  ret = snprintf(source, sizeof(source), "%s%s", client_key,
                 BKVOICE_WSS_GUID);
  if (ret < 0 || (size_t)ret >= sizeof(source))
    {
      return -EOVERFLOW;
    }

  ret = wss->tls_ops.sha1(wss->tls_context, (const uint8_t *)source,
                          (size_t)ret, digest);
  memset(source, 0, sizeof(source));
  if (ret != 0)
    {
      memset(digest, 0, sizeof(digest));
      return ret < 0 ? ret : -EIO;
    }

  ret = bkvoice_wss_base64_encode(digest, sizeof(digest), accept,
                                  BKVOICE_WSS_ACCEPT_KEY_BYTES);
  memset(digest, 0, sizeof(digest));
  return ret < 0 ? ret : 0;
}

static bool bkvoice_wss_header_name_equal(const char *name,
                                          size_t name_size,
                                          const char *expected)
{
  return strlen(expected) == name_size &&
         strncasecmp(name, expected, name_size) == 0;
}

static const char *bkvoice_wss_trim_value(char *value)
{
  char *end;

  while (*value == ' ' || *value == '\t')
    {
      value++;
    }

  end = value + strlen(value);
  while (end > value && (*(end - 1) == ' ' || *(end - 1) == '\t'))
    {
      *--end = '\0';
    }

  return value;
}

static bool bkvoice_wss_token_list_contains(const char *value,
                                            const char *expected)
{
  size_t expected_size = strlen(expected);

  while (*value != '\0')
    {
      const char *begin;
      const char *end;

      while (*value == ' ' || *value == '\t' || *value == ',')
        {
          value++;
        }

      begin = value;
      while (*value != '\0' && *value != ',')
        {
          value++;
        }

      end = value;
      while (end > begin &&
             (*(end - 1) == ' ' || *(end - 1) == '\t'))
        {
          end--;
        }

      if ((size_t)(end - begin) == expected_size &&
          strncasecmp(begin, expected, expected_size) == 0)
        {
          return true;
        }
    }

  return false;
}

static int bkvoice_wss_validate_response(
  struct bkvoice_wss_s *wss, char *response, const char *expected_accept)
{
  char *line;
  char *next;
  bool upgrade = false;
  bool connection = false;
  bool accept = false;
  bool protocol = false;

  next = strstr(response, "\r\n");
  if (next == NULL)
    {
      return -EPROTO;
    }

  *next = '\0';
  if (strncmp(response, "HTTP/1.1 101", 12) != 0 ||
      (response[12] != '\0' && response[12] != ' '))
    {
      return -ECONNREFUSED;
    }

  line = next + 2;
  while (*line != '\0')
    {
      char *colon;
      const char *value;
      size_t name_size;

      next = strstr(line, "\r\n");
      if (next == NULL)
        {
          return -EPROTO;
        }

      *next = '\0';
      if (*line == '\0')
        {
          break;
        }

      colon = strchr(line, ':');
      if (colon == NULL || colon == line ||
          *(colon - 1) == ' ' || *(colon - 1) == '\t')
        {
          return -EPROTO;
        }

      name_size = (size_t)(colon - line);
      value = bkvoice_wss_trim_value(colon + 1);
      if (bkvoice_wss_header_name_equal(line, name_size, "Upgrade"))
        {
          if (upgrade || !bkvoice_wss_token_list_contains(value,
                                                          "websocket"))
            {
              return -EPROTO;
            }

          upgrade = true;
        }
      else if (bkvoice_wss_header_name_equal(line, name_size,
                                             "Connection"))
        {
          if (!bkvoice_wss_token_list_contains(value, "upgrade"))
            {
              return -EPROTO;
            }

          connection = true;
        }
      else if (bkvoice_wss_header_name_equal(
                 line, name_size, "Sec-WebSocket-Accept"))
        {
          if (accept || strcmp(value, expected_accept) != 0)
            {
              return -EACCES;
            }

          accept = true;
        }
      else if (bkvoice_wss_header_name_equal(
                 line, name_size, "Sec-WebSocket-Protocol"))
        {
          if (protocol || strcmp(value, wss->subprotocol) != 0)
            {
              return -EPROTO;
            }

          protocol = true;
        }
      else if (bkvoice_wss_header_name_equal(
                 line, name_size, "Sec-WebSocket-Extensions") &&
               *value != '\0')
        {
          return -ENOTSUP;
        }

      line = next + 2;
    }

  return upgrade && connection && accept && protocol ? 0 : -EPROTO;
}

static int bkvoice_wss_upgrade(struct bkvoice_wss_s *wss,
                               uint64_t deadline_ms)
{
  uint8_t nonce[BKVOICE_WSS_NONCE_BYTES];
  char client_key[BKVOICE_WSS_CLIENT_KEY_BYTES];
  char expected_accept[BKVOICE_WSS_ACCEPT_KEY_BYTES];
  char request[BKVOICE_WSS_REQUEST_BYTES];
  char response[BKVOICE_WSS_RESPONSE_BYTES];
  size_t received = 0;
  int request_size;
  int ret;

