open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_wss.c
  ret = wss->tls_ops.random(wss->tls_context, nonce, sizeof(nonce));
  if (ret != 0)
    {
      return ret < 0 ? ret : -EIO;
    }

  ret = bkvoice_wss_base64_encode(nonce, sizeof(nonce), client_key,
                                  sizeof(client_key));
  memset(nonce, 0, sizeof(nonce));
  if (ret < 0)
    {
      return ret;
    }

  ret = bkvoice_wss_make_accept(wss, client_key, expected_accept);
  if (ret < 0)
    {
      memset(client_key, 0, sizeof(client_key));
      return ret;
    }

  if (wss->port == 443u)
    {
      request_size = snprintf(
        request, sizeof(request),
        "GET %s HTTP/1.1\r\n"
        "Host: %s\r\n"
        "Upgrade: websocket\r\n"
        "Connection: Upgrade\r\n"
        "Sec-WebSocket-Key: %s\r\n"
        "Sec-WebSocket-Version: 13\r\n"
        "Sec-WebSocket-Protocol: %s\r\n\r\n",
        wss->path, wss->host, client_key, wss->subprotocol);
    }
  else
    {
      request_size = snprintf(
        request, sizeof(request),
        "GET %s HTTP/1.1\r\n"
        "Host: %s:%u\r\n"
        "Upgrade: websocket\r\n"
        "Connection: Upgrade\r\n"
        "Sec-WebSocket-Key: %s\r\n"
        "Sec-WebSocket-Version: 13\r\n"
        "Sec-WebSocket-Protocol: %s\r\n\r\n",
        wss->path, wss->host, (unsigned int)wss->port, client_key,
        wss->subprotocol);
    }

  memset(client_key, 0, sizeof(client_key));
  if (request_size < 0 || (size_t)request_size >= sizeof(request))
    {
      memset(expected_accept, 0, sizeof(expected_accept));
      return -EOVERFLOW;
    }

  ret = bkvoice_wss_raw_send_all(wss, (const uint8_t *)request,
                                 (size_t)request_size, deadline_ms);
  memset(request, 0, sizeof(request));
  if (ret < 0)
    {
      memset(expected_accept, 0, sizeof(expected_accept));
      return ret;
    }

  while (received + 1u < sizeof(response))
    {
      ret = bkvoice_wss_raw_recv_exact(
        wss, (uint8_t *)&response[received], 1, deadline_ms);
      if (ret < 0)
        {
          memset(expected_accept, 0, sizeof(expected_accept));
          return ret;
        }

      received++;
      if (received >= 4u &&
          memcmp(response + received - 4u, "\r\n\r\n", 4) == 0)
        {
          response[received] = '\0';
          ret = bkvoice_wss_validate_response(wss, response,
                                              expected_accept);
          memset(expected_accept, 0, sizeof(expected_accept));
          memset(response, 0, sizeof(response));
          return ret;
        }
    }

  memset(expected_accept, 0, sizeof(expected_accept));
  memset(response, 0, sizeof(response));
  return -EOVERFLOW;
}

static int bkvoice_wss_tx_lock(struct bkvoice_wss_s *wss)
{
  int ret = pthread_mutex_lock(&wss->tx_lock);
  return ret == 0 ? 0 : -ret;
}

static void bkvoice_wss_tx_unlock(struct bkvoice_wss_s *wss)
{
  (void)pthread_mutex_unlock(&wss->tx_lock);
}

static int bkvoice_wss_send_frame_locked(struct bkvoice_wss_s *wss,
                                         uint8_t opcode,
                                         const uint8_t *payload,
                                         size_t payload_size,
                                         uint64_t deadline_ms)
{
  uint8_t header[8];
  uint8_t mask[4];
  uint8_t chunk[BKVOICE_WSS_MASK_CHUNK_BYTES];
  size_t header_size;
  size_t offset = 0;
  int ret;

  if (payload_size != 0 && payload == NULL)
    {
      return -EINVAL;
    }

  if ((opcode & 0x08u) != 0 && payload_size > BKVOICE_WSS_CONTROL_BYTES)
    {
      return -EMSGSIZE;
    }

  if (payload_size > UINT16_MAX)
    {
      return -EMSGSIZE;
    }

  ret = wss->tls_ops.random(wss->tls_context, mask, sizeof(mask));
  if (ret != 0)
    {
      return ret < 0 ? ret : -EIO;
    }

  header[0] = 0x80u | opcode;
  if (payload_size <= 125u)
    {
      header[1] = 0x80u | (uint8_t)payload_size;
      memcpy(header + 2, mask, sizeof(mask));
      header_size = 6u;
    }
  else
    {
      header[1] = 0x80u | 126u;
      header[2] = (uint8_t)(payload_size >> 8);
      header[3] = (uint8_t)payload_size;
      memcpy(header + 4, mask, sizeof(mask));
      header_size = 8u;
    }

  ret = bkvoice_wss_raw_send_all(wss, header, header_size, deadline_ms);
  if (ret < 0)
    {
      return ret;
    }

  while (offset < payload_size)
    {
      size_t i;
      size_t bytes = payload_size - offset;

      if (bytes > sizeof(chunk))
        {
          bytes = sizeof(chunk);
        }

      for (i = 0; i < bytes; i++)
        {
          chunk[i] = payload[offset + i] ^ mask[(offset + i) & 3u];
        }

      ret = bkvoice_wss_raw_send_all(wss, chunk, bytes, deadline_ms);
      memset(chunk, 0, bytes);
      if (ret < 0)
        {
          return ret;
        }

      offset += bytes;
    }

  return 0;
}

static int bkvoice_wss_send_frame(struct bkvoice_wss_s *wss,
                                  uint8_t opcode,
                                  const uint8_t *payload,
                                  size_t payload_size,
                                  uint64_t deadline_ms)
{
  int ret = bkvoice_wss_tx_lock(wss);

  if (ret < 0)
    {
      return ret;
    }

  ret = bkvoice_wss_send_frame_locked(wss, opcode, payload, payload_size,
                                      deadline_ms);
  bkvoice_wss_tx_unlock(wss);
  return ret;
}

static bool bkvoice_wss_utf8_valid(const uint8_t *text, size_t bytes)
{
  size_t offset = 0;

  while (offset < bytes)
    {
      uint8_t first = text[offset++];
      size_t continuation;

      if (first <= 0x7fu)
        {
          continue;
        }

      if (first >= 0xc2u && first <= 0xdfu)
        {
          continuation = 1u;
        }
      else if (first >= 0xe0u && first <= 0xefu)
        {
          if (offset >= bytes ||
              (first == 0xe0u && text[offset] < 0xa0u) ||
              (first == 0xedu && text[offset] > 0x9fu))
            {
              return false;
            }

          continuation = 2u;
        }
      else if (first >= 0xf0u && first <= 0xf4u)
        {
          if (offset >= bytes ||
              (first == 0xf0u && text[offset] < 0x90u) ||
              (first == 0xf4u && text[offset] > 0x8fu))
            {
              return false;
            }

          continuation = 3u;
        }
      else
        {
          return false;
        }

      if (continuation > bytes - offset)
        {
          return false;
        }

      while (continuation-- > 0)
        {
          if ((text[offset++] & 0xc0u) != 0x80u)
            {
              return false;
            }
        }
    }

