open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_wss.c
  return true;
}

static bool bkvoice_wss_close_payload_valid(const uint8_t *payload,
                                            size_t payload_size)
{
  uint16_t code;

  if (payload_size == 0)
    {
      return true;
    }

  if (payload_size == 1u)
    {
      return false;
    }

  code = ((uint16_t)payload[0] << 8) | payload[1];
  if (code < 1000u || code >= 5000u || code == 1004u || code == 1005u ||
      code == 1006u || code == 1015u)
    {
      return false;
    }

  return bkvoice_wss_utf8_valid(payload + 2u, payload_size - 2u);
}

static int bkvoice_wss_read_length(struct bkvoice_wss_s *wss,
                                   uint8_t length_code,
                                   uint64_t *payload_size,
                                   uint64_t deadline_ms)
{
  uint8_t extended[8];
  size_t i;
  int ret;

  if (length_code <= 125u)
    {
      *payload_size = length_code;
      return 0;
    }

  if (length_code == 126u)
    {
      ret = bkvoice_wss_raw_recv_exact(wss, extended, 2, deadline_ms);
      if (ret < 0)
        {
          return ret;
        }

      *payload_size = ((uint64_t)extended[0] << 8) | extended[1];
      return *payload_size >= 126u ? 0 : -EPROTO;
    }

  ret = bkvoice_wss_raw_recv_exact(wss, extended, sizeof(extended),
                                   deadline_ms);
  if (ret < 0)
    {
      return ret;
    }

  if ((extended[0] & 0x80u) != 0)
    {
      return -EPROTO;
    }

  *payload_size = 0;
  for (i = 0; i < sizeof(extended); i++)
    {
      *payload_size = (*payload_size << 8) | extended[i];
    }

  if (*payload_size <= UINT16_MAX)
    {
      return -EPROTO;
    }

  return -EMSGSIZE;
}

static int bkvoice_wss_handle_control(struct bkvoice_wss_s *wss,
                                      uint8_t opcode, bool final,
                                      uint64_t payload_size,
                                      uint64_t deadline_ms)
{
  uint8_t payload[BKVOICE_WSS_CONTROL_BYTES];
  int ret;

  if (!final || payload_size > sizeof(payload))
    {
      return -EPROTO;
    }

  if (payload_size != 0)
    {
      ret = bkvoice_wss_raw_recv_exact(wss, payload, (size_t)payload_size,
                                       deadline_ms);
      if (ret < 0)
        {
          return ret;
        }
    }

  if (opcode == BKVOICE_WSS_OPCODE_PING)
    {
      ret = bkvoice_wss_send_frame(wss, BKVOICE_WSS_OPCODE_PONG, payload,
                                   (size_t)payload_size, deadline_ms);
      if (ret >= 0)
        {
          __atomic_add_fetch(&wss->ping_count, 1u, __ATOMIC_RELAXED);
        }

      return ret;
    }

  if (opcode == BKVOICE_WSS_OPCODE_PONG)
    {
      __atomic_add_fetch(&wss->pong_count, 1u, __ATOMIC_RELAXED);
      return 0;
    }

  if (opcode == BKVOICE_WSS_OPCODE_CLOSE)
    {
      if (!bkvoice_wss_close_payload_valid(payload, (size_t)payload_size))
        {
          return -EPROTO;
        }

      ret = bkvoice_wss_send_frame(wss, BKVOICE_WSS_OPCODE_CLOSE, payload,
                                   (size_t)payload_size, deadline_ms);
      if (ret < 0)
        {
          return ret;
        }

      __atomic_store_n(&wss->peer_closed, true, __ATOMIC_RELEASE);
      __atomic_store_n(&wss->last_error, -ECONNRESET, __ATOMIC_RELEASE);
      return 1;
    }

  return -EPROTO;
}

static int bkvoice_wss_load_message(struct bkvoice_wss_s *wss,
                                    uint64_t deadline_ms)
{
  struct bkvoice_companion_header_s companion;
  const uint8_t *payload;
  bool fragmented = false;

  wss->rx_size = 0;
  wss->rx_offset = 0;
  for (; ; )
    {
      uint8_t header[2];
      uint8_t opcode;
      uint64_t payload_size;
      bool final;
      int ret;

      ret = bkvoice_wss_raw_recv_exact(wss, header, sizeof(header),
                                       deadline_ms);
      if (ret < 0)
        {
          return ret;
        }

      final = (header[0] & 0x80u) != 0;
      opcode = header[0] & 0x0fu;
      if ((header[0] & 0x70u) != 0 || (header[1] & 0x80u) != 0)
        {
          return -EPROTO;
        }

      ret = bkvoice_wss_read_length(wss, header[1] & 0x7fu,
                                    &payload_size, deadline_ms);
      if (ret < 0)
        {
          return ret;
        }

      if ((opcode & 0x08u) != 0)
        {
          ret = bkvoice_wss_handle_control(wss, opcode, final,
                                           payload_size, deadline_ms);
          if (ret != 0)
            {
              return ret;
            }

          continue;
        }

      if (opcode == BKVOICE_WSS_OPCODE_TEXT)
        {
          return -EPROTO;
        }

      if (opcode == BKVOICE_WSS_OPCODE_BINARY)
        {
          if (fragmented || wss->rx_size != 0)
            {
              return -EPROTO;
            }

          fragmented = !final;
        }
      else if (opcode == BKVOICE_WSS_OPCODE_CONTINUATION)
        {
          if (!fragmented)
            {
              return -EPROTO;
            }

          fragmented = !final;
        }
      else
        {
          return -EPROTO;
        }

      if (payload_size > sizeof(wss->rx_message) - wss->rx_size)
        {
          return -EMSGSIZE;
        }

      ret = bkvoice_wss_raw_recv_exact(
        wss, wss->rx_message + wss->rx_size, (size_t)payload_size,
        deadline_ms);
      if (ret < 0)
        {
          return ret;
        }

      wss->rx_size += (size_t)payload_size;
      if (!fragmented)
        {
          ret = bkvoice_companion_decode(wss->rx_message, wss->rx_size,
                                         &companion, &payload);
          if (ret < 0)
            {
              return ret;
            }

          (void)payload;
          __atomic_add_fetch(&wss->rx_messages, 1u, __ATOMIC_RELAXED);
          return 0;
        }
    }
}

static int bkvoice_wss_transport_open(void *context, uint64_t deadline_ms)
{
  struct bkvoice_wss_s *wss = context;
  int ret;

  if (wss == NULL || !wss->initialized)
    {
      return -EINVAL;
    }

  if (__atomic_load_n(&wss->tls_open, __ATOMIC_ACQUIRE))
    {
      ret = wss->tls_ops.close(wss->tls_context);
      if (ret != 0)
        {
          return ret < 0 ? ret : -EIO;
        }

      __atomic_store_n(&wss->tls_open, false, __ATOMIC_RELEASE);
      __atomic_store_n(&wss->upgraded, false, __ATOMIC_RELEASE);
    }

