open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_wss.c
  ret = wss->tls_ops.open_verified(wss->tls_context, wss->host, wss->port,
                                   deadline_ms);
  if (ret != 0)
    {
      return bkvoice_wss_error(wss, ret < 0 ? ret : -EIO, false);
    }

  __atomic_store_n(&wss->tls_open, true, __ATOMIC_RELEASE);
  ret = bkvoice_wss_upgrade(wss, deadline_ms);
  if (ret < 0)
    {
      int close_ret = wss->tls_ops.close(wss->tls_context);

      if (close_ret == 0)
        {
          __atomic_store_n(&wss->tls_open, false, __ATOMIC_RELEASE);
        }

      return bkvoice_wss_error(wss, ret, close_ret != 0);
    }

  wss->rx_size = 0;
  wss->rx_offset = 0;
  __atomic_store_n(&wss->tx_messages, 0, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->rx_messages, 0, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->ping_count, 0, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->pong_count, 0, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->last_error, 0, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->interrupted, false, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->peer_closed, false, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->faulted, false, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->upgraded, true, __ATOMIC_RELEASE);
  return 0;
}

static ssize_t bkvoice_wss_transport_send(void *context,
                                          const uint8_t *buffer,
                                          size_t bytes,
                                          uint64_t deadline_ms)
{
  struct bkvoice_wss_s *wss = context;
  struct bkvoice_companion_header_s companion;
  const uint8_t *payload;
  int ret;

  if (wss == NULL || !wss->initialized || buffer == NULL)
    {
      return -EINVAL;
    }

  if (!__atomic_load_n(&wss->upgraded, __ATOMIC_ACQUIRE))
    {
      return -ENOTCONN;
    }

  if (__atomic_load_n(&wss->interrupted, __ATOMIC_ACQUIRE))
    {
      return -ECANCELED;
    }

  if (__atomic_load_n(&wss->faulted, __ATOMIC_ACQUIRE))
    {
      ret = __atomic_load_n(&wss->last_error, __ATOMIC_ACQUIRE);
      return ret < 0 ? ret : -EIO;
    }

  ret = bkvoice_companion_decode(buffer, bytes, &companion, &payload);
  if (ret < 0)
    {
      return ret;
    }

  (void)payload;
  ret = bkvoice_wss_send_frame(wss, BKVOICE_WSS_OPCODE_BINARY, buffer, bytes,
                               deadline_ms);
  if (ret < 0)
    {
      return bkvoice_wss_error(wss, ret, true);
    }

  __atomic_add_fetch(&wss->tx_messages, 1u, __ATOMIC_RELAXED);
  __atomic_store_n(&wss->last_error, 0, __ATOMIC_RELEASE);
  return (ssize_t)bytes;
}

static ssize_t bkvoice_wss_transport_recv(void *context, uint8_t *buffer,
                                          size_t bytes,
                                          uint64_t deadline_ms)
{
  struct bkvoice_wss_s *wss = context;
  size_t available;
  int ret;

  if (wss == NULL || !wss->initialized || (bytes != 0 && buffer == NULL))
    {
      return -EINVAL;
    }

  if (bytes == 0)
    {
      return 0;
    }

  if (!__atomic_load_n(&wss->upgraded, __ATOMIC_ACQUIRE))
    {
      return -ENOTCONN;
    }

  if (__atomic_load_n(&wss->interrupted, __ATOMIC_ACQUIRE))
    {
      return -ECANCELED;
    }

  if (__atomic_load_n(&wss->peer_closed, __ATOMIC_ACQUIRE))
    {
      return 0;
    }

  if (__atomic_load_n(&wss->faulted, __ATOMIC_ACQUIRE))
    {
      ret = __atomic_load_n(&wss->last_error, __ATOMIC_ACQUIRE);
      return ret < 0 ? ret : -EIO;
    }

  if (wss->rx_offset == wss->rx_size)
    {
      ret = bkvoice_wss_load_message(wss, deadline_ms);
      if (ret == 1)
        {
          return 0;
        }

      if (ret < 0)
        {
          return bkvoice_wss_error(wss, ret, true);
        }
    }

  available = wss->rx_size - wss->rx_offset;
  if (bytes > available)
    {
      bytes = available;
    }

  memcpy(buffer, wss->rx_message + wss->rx_offset, bytes);
  wss->rx_offset += bytes;
  __atomic_store_n(&wss->last_error, 0, __ATOMIC_RELEASE);
  return (ssize_t)bytes;
}

static int bkvoice_wss_transport_interrupt(void *context)
{
  struct bkvoice_wss_s *wss = context;
  int ret;

  if (wss == NULL || !wss->initialized)
    {
      return -EINVAL;
    }

  if (!__atomic_load_n(&wss->tls_open, __ATOMIC_ACQUIRE))
    {
      return 0;
    }

  __atomic_store_n(&wss->interrupted, true, __ATOMIC_RELEASE);
  ret = wss->tls_ops.interrupt(wss->tls_context);
  if (ret != 0)
    {
      return bkvoice_wss_error(wss, ret < 0 ? ret : -EIO, false);
    }

  return 0;
}

static int bkvoice_wss_transport_close(void *context)
{
  struct bkvoice_wss_s *wss = context;
  int ret;

  if (wss == NULL || !wss->initialized)
    {
      return -EINVAL;
    }

  if (!__atomic_load_n(&wss->tls_open, __ATOMIC_ACQUIRE))
    {
      return 0;
    }

  /* The generic transport close operation has no deadline.  Do not risk an
   * unbounded graceful-close write here: interrupt/join has already happened
   * and the verified TLS provider's close() contract is itself bounded.
   * A peer-initiated CLOSE is still echoed from the receive path using that
   * receive operation's absolute deadline.
   */

  ret = wss->tls_ops.close(wss->tls_context);
  if (ret != 0)
    {
      return bkvoice_wss_error(wss, ret < 0 ? ret : -EIO, false);
    }

  wss->rx_size = 0;
  wss->rx_offset = 0;
  __atomic_store_n(&wss->tls_open, false, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->upgraded, false, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->interrupted, false, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->peer_closed, false, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->faulted, false, __ATOMIC_RELEASE);
  __atomic_store_n(&wss->last_error, 0, __ATOMIC_RELEASE);
  return 0;
}

static const struct bkvoice_transport_ops_s g_bkvoice_wss_transport_ops =
{
  .open = bkvoice_wss_transport_open,
  .send = bkvoice_wss_transport_send,
  .recv = bkvoice_wss_transport_recv,
  .interrupt = bkvoice_wss_transport_interrupt,
  .close = bkvoice_wss_transport_close,
};

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bkvoice_wss_initialize(
  struct bkvoice_wss_s *wss,
  const struct bkvoice_wss_tls_ops_s *tls_ops, void *tls_context,
  const struct bkvoice_wss_config_s *config)
{
  int ret;

  if (wss == NULL || tls_context == NULL || config == NULL ||
      !bkvoice_wss_tls_ops_valid(tls_ops) || config->port == 0 ||
      !bkvoice_wss_host_valid(config->host) ||
      !bkvoice_wss_path_valid(config->path) ||
      !bkvoice_wss_subprotocol_valid(config->subprotocol))
    {
      return -EINVAL;
    }

  memset(wss, 0, sizeof(*wss));
  memcpy(&wss->tls_ops, tls_ops, sizeof(*tls_ops));
  wss->tls_context = tls_context;
  wss->port = config->port;
  memcpy(wss->host, config->host, strlen(config->host) + 1u);
  memcpy(wss->path, config->path, strlen(config->path) + 1u);
  memcpy(wss->subprotocol, config->subprotocol,
         strlen(config->subprotocol) + 1u);

  ret = pthread_mutex_init(&wss->tx_lock, NULL);
  if (ret != 0)
    {
      memset(wss, 0, sizeof(*wss));
      return -ret;
    }

  wss->initialized = true;
  return 0;
}

