open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_wss.c
int bkvoice_wss_uninitialize(struct bkvoice_wss_s *wss)
{
  int ret;

  if (wss == NULL || !wss->initialized)
    {
      return -EINVAL;
    }

  if (__atomic_load_n(&wss->tls_open, __ATOMIC_ACQUIRE))
    {
      return -EBUSY;
    }

  ret = pthread_mutex_destroy(&wss->tx_lock);
  if (ret != 0)
    {
      return -ret;
    }

  memset(wss, 0, sizeof(*wss));
  return 0;
}

const struct bkvoice_transport_ops_s *bkvoice_wss_transport_ops(void)
{
  return &g_bkvoice_wss_transport_ops;
}

void bkvoice_wss_snapshot(const struct bkvoice_wss_s *wss,
                          struct bkvoice_wss_snapshot_s *snapshot)
{
  if (wss == NULL || snapshot == NULL)
    {
      return;
    }

  memset(snapshot, 0, sizeof(*snapshot));
  snapshot->tx_messages = __atomic_load_n(&wss->tx_messages,
                                          __ATOMIC_ACQUIRE);
  snapshot->rx_messages = __atomic_load_n(&wss->rx_messages,
                                          __ATOMIC_ACQUIRE);
  snapshot->ping_count = __atomic_load_n(&wss->ping_count,
                                         __ATOMIC_ACQUIRE);
  snapshot->pong_count = __atomic_load_n(&wss->pong_count,
                                         __ATOMIC_ACQUIRE);
  snapshot->last_error = __atomic_load_n(&wss->last_error,
                                         __ATOMIC_ACQUIRE);
  snapshot->tls_open = __atomic_load_n(&wss->tls_open,
                                       __ATOMIC_ACQUIRE);
  snapshot->upgraded = __atomic_load_n(&wss->upgraded,
                                       __ATOMIC_ACQUIRE);
  snapshot->interrupted = __atomic_load_n(&wss->interrupted,
                                          __ATOMIC_ACQUIRE);
  snapshot->peer_closed = __atomic_load_n(&wss->peer_closed,
                                          __ATOMIC_ACQUIRE);
  snapshot->faulted = __atomic_load_n(&wss->faulted,
                                      __ATOMIC_ACQUIRE);
  snapshot->initialized = wss->initialized;
}
